# WEEK 2 TUTORIAL

In [2]:
print("Select Heading then Shift && Enter to make the heading")

Select Heading then Shift && Enter to make the heading

In [5]:
import os
import pandas as pd

In [6]:
from matplotlib import pyplot as plt

In [7]:
import matplotlib.pyplot as plt

In [8]:
os.chdir("C:\\Users\\Nicol Foo\\OneDrive\\Desktop\\School stuff\\MONASH\\FIT1043 - 2022 S2\\DATASET")
os.getcwd()

'C:\\Users\\Nicol Foo\\OneDrive\\Desktop\\School stuff\\MONASH\\FIT1043 - 2022 S2\\DATASET'

In [34]:
print("MUST DOUBLE \\ TO PREVENT \ WHICH WILL CAUSE ERROR DUE TO THE USE OF \ IN PYTHON AS A SPECIAL CHARACTER")

MUST DOUBLE \ TO PREVENT \ WHICH WILL CAUSE ERROR DUE TO THE USE OF \ IN PYTHON AS A SPECIAL CHARACTER

In [9]:
pd.DataFrame?

In [22]:
df = pd.DataFrame((
'StudentID' : [264422,264423,264444,264445,264446],
'FirstName' : ['Steven','Alex','Bill','Mark','Bob'],
'EnrolYear' : [2010,2010,2011,2011,2013],
'Math' : [100,90,90,40,60],
'English' : [60,70,80,80,60]
))

SyntaxError: invalid syntax (2463482152.py, line 2)

In [12]:
df

   StudentID FirstName  EnrolYear  Math  English
0     264422    Steven       2010   100       60
1     264423      Alex       2010    90       70
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80
4     264446       Bob       2013    60       60

In [21]:
df2 = pd.DataFrame({
    'Height': [160, 155, 175, 175],
    'Student': [264422, 264423, 264444, 264445]
})
df2

   Height  Student
0     160   264422
1     155   264423
2     175   264444
3     175   264445

In [23]:
df['FirstName']

0    Steven
1      Alex
2      Bill
3      Mark
4       Bob
Name: FirstName, dtype: object

In [24]:
df.FirstName

0    Steven
1      Alex
2      Bill
3      Mark
4       Bob
Name: FirstName, dtype: object

In [25]:
df[df['FirstName'] == 'Alex']

   StudentID FirstName  EnrolYear  Math  English
1     264423      Alex       2010    90       70

In [26]:
df['FirstName'] == 'Alex'

0    False
1     True
2    False
3    False
4    False
Name: FirstName, dtype: bool

In [27]:
print("It's giving a boolean result of every FirstName in list if the FirstName is equal to Alex")

It's giving a boolean result of every FirstName in list if the FirstName is equal to Alex

In [29]:
df[df.EnrolYear == 2011]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

In [30]:
filt = (df.FirstName != 'Bob') & (df.StudentID > 264423)
df[filt]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

In [31]:
# Add new column
df['Total'] = df['Math'] + df['English']
df

   StudentID FirstName  EnrolYear  Math  English  Total
0     264422    Steven       2010   100       60    160
1     264423      Alex       2010    90       70    160
2     264444      Bill       2011    90       80    170
3     264445      Mark       2011    40       80    120
4     264446       Bob       2013    60       60    120

In [33]:
print(" & equal AND while | equal OR")

 & equal AND while | equal OR

In [38]:
df['Average'] = df['Total']/2
df

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0
1     264423      Alex       2010    90       70    160     80.0
2     264444      Bill       2011    90       80    170     85.0
3     264445      Mark       2011    40       80    120     60.0
4     264446       Bob       2013    60       60    120     60.0

In [40]:
df[(df['Total']>150) & ((df['Math'] >= 90) | (df['English'] >= 90 ))]
df

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0
1     264423      Alex       2010    90       70    160     80.0
2     264444      Bill       2011    90       80    170     85.0
3     264445      Mark       2011    40       80    120     60.0
4     264446       Bob       2013    60       60    120     60.0

In [52]:
df2

   Height  Student
0     160   264422
1     155   264423
2     175   264444
3     175   264445

In [49]:
df.rename(columns = {'value':'Score'}, inplace = True)
df

   EnrolYear FirstName  StudentID  Subject  Score
0       2010    Steven     264422     Math    100
1       2010      Alex     264423     Math     90
2       2011      Bill     264444     Math     90
3       2011      Mark     264445     Math     40
4       2013       Bob     264446     Math     60
5       2010    Steven     264422  English     60
6       2010      Alex     264423  English     70
7       2011      Bill     264444  English     80
8       2011      Mark     264445  English     80
9       2013       Bob     264446  English     60

In [57]:
ufo_reports = pd.read_csv('uforeports.csv')
ufo_reports.head() # print the first 5 records

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [58]:
ufo_reports.tail()

              City Colors Reported Shape Reported State                 Time
18236   Grant Park             NaN       TRIANGLE    IL  2000-12-31 23:00:00
18237  Spirit Lake             NaN           DISK    IA  2000-12-31 23:00:00
18238  Eagle River             NaN            NaN    WI  2000-12-31 23:45:00
18239  Eagle River             RED          LIGHT    WI  2000-12-31 23:45:00
18240         Ybor             NaN           OVAL    FL  2000-12-31 23:59:00

In [60]:
ufo_reports_xls = pd.read_excel(
'Uforeports_excel.xls',
sheet_name='uforeports')

In [61]:
print(ufo_reports.Time.dtypes)

object

In [62]:
print(ufo_reports_xls.Time.dtypes)

datetime64[ns]

In [63]:
# change to datetime format
ufo_reports.Time = pd.to_datetime(ufo_reports.Time)
print (ufo_reports.Time.dtypes) # print its datatype now
ufo_reports.head()

datetime64[ns]

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00